@echo off
color 0a
title 文件夹内.js .map文件删除---
echo ★☆ ★☆ ★☆ ★☆ ★☆★☆★☆ ★☆ ★☆ ★☆ ★☆★
echo ★☆ ★☆ ★☆ ★☆ ★☆★☆★☆ ★☆ ★☆ ★☆ ★☆★
echo.★☆                                              ☆★
echo.★☆                                              ☆★
echo.★☆   清理.js .map文件，请稍等......             ☆★
echo ★☆                                              ☆★
echo.★☆                                              ☆★
echo ★☆ ★☆ ★☆ ★☆ ★☆★☆★☆ ★☆ ★☆ ★☆ ★☆★
echo ★☆ ★☆ ★☆ ★☆ ★☆★☆★☆ ★☆ ★☆ ★☆ ★☆★
echo 请勿关闭本窗口。 
echo 正在清除.js文件请稍后......
del /f /s /q *.js
echo 正在清除 .map文件请稍后......
del /f /s /q *.map

echo 
echo ★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★
echo ★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★
echo ★☆                                                          ☆★
echo.★☆                                                          ☆★
echo.★☆                                                          ☆★
echo ★☆                                                          ☆★
echo ★☆                恭喜您！清理全部完成！                    ☆★
echo.★☆                                                          ☆★
echo ★☆                                                          ☆★
echo.★☆                                                          ☆★
echo ★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★
echo ★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★☆★
pause